# Dotfiles Brewfile
# Install with: brew bundle --file=Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"  # aerospace

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "starship"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "wget"
brew "coreutils"
brew "gnu-sed"

# =============================================================================
# Development Tools
# =============================================================================
brew "uv"              # Fast Python package manager
brew "lazygit"         # Git TUI
brew "gh"              # GitHub CLI
brew "glab"            # GitLab CLI
brew "node"
brew "go"
brew "rust"
brew "lua-language-server"
brew "tree-sitter"

# =============================================================================
# Kubernetes & Cloud
# =============================================================================
brew "kubernetes-cli"
brew "kubecolor"
brew "helm"
brew "k9s"
brew "kind"
brew "argocd"
brew "awscli"
brew "terraform"

# =============================================================================
# Docker
# =============================================================================
brew "docker"
brew "docker-compose"
brew "lazydocker"

# =============================================================================
# File Management & Utilities
# =============================================================================
brew "btop"            # System monitor
brew "superfile"       # File manager TUI
brew "yazi"            # File manager
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "chafa"           # Image viewer for terminal

# =============================================================================
# Casks (GUI Applications)
# =============================================================================
cask "aerospace"       # Tiling window manager
cask "ghostty"         # Terminal emulator

# =============================================================================
# Fonts
# =============================================================================
cask "font-hack-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
