# Dotfiles Brewfile
# Install with: brew bundle --file=Brewfile

# Taps
tap "nikitabobko/tap"   # aerospace
tap "manaflow-ai/cmux"  # cmux
tap "oven-sh/bun"       # bun
tap "sst/tap"           # opencode

# =============================================================================
# Core CLI Tools
# =============================================================================
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "starship"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "wget"
brew "xh"              # Modern HTTP client
brew "coreutils"
brew "gnu-sed"

# =============================================================================
# Development Tools
# =============================================================================
brew "uv"              # Fast Python package manager
brew "pipx"            # Install/run Python CLI tools in isolation
brew "lazygit"         # Git TUI
brew "gh"              # GitHub CLI
brew "glab"            # GitLab CLI
brew "node"
brew "oven-sh/bun/bun" # Fast JS runtime & package manager
brew "go"
brew "rust"
brew "bob"             # Neovim version manager
brew "lua-language-server"
brew "luarocks"        # Lua package manager
brew "luajit"          # Lua 5.1 for image.nvim
brew "tree-sitter"
brew "graphviz"        # Graph/diagram generation
brew "python@3.13"     # Python for neovim provider
brew "ruby"            # Ruby for neovim provider
brew "tectonic"        # Modern LaTeX engine

# =============================================================================
# Kubernetes & Cloud
# =============================================================================
brew "kubernetes-cli"
brew "kubecolor"
brew "kustomize"       # Kubernetes config customisation
brew "helm"
brew "k9s"
brew "kind"
brew "argocd"
brew "awscli"
brew "terraform"

# =============================================================================
# Docker
# =============================================================================
brew "docker"
brew "docker-compose"
brew "lazydocker"

# =============================================================================
# File Management & Utilities
# =============================================================================
brew "bottom"          # System monitor (btm) - used by AstroNvim
brew "btop"            # System monitor
brew "superfile"       # File manager TUI
brew "yazi"            # File manager
brew "ffmpeg"
brew "imagemagick"
brew "pandoc"
brew "chafa"           # Image viewer for terminal
brew "posting"         # API testing TUI

# =============================================================================
# Database
# =============================================================================
brew "postgresql@14"

# =============================================================================
# Casks (GUI Applications)
# =============================================================================
cask "nikitabobko/tap/aerospace"  # Tiling window manager
cask "ghostty"         # Terminal emulator
cask "raycast"         # Spotlight replacement
cask "handy"           # Offline speech-to-text
cask "obsidian"        # Knowledge management
cask "manaflow-ai/cmux/cmux"  # AI agent terminal manager
cask "claude-code"     # Claude CLI agent
cask "codex"           # OpenAI coding agent
cask "gcloud-cli"      # Google Cloud SDK
cask "ngrok"           # Secure tunnelling

# =============================================================================
# AI & Agentic Tools
# =============================================================================
brew "claude-squad"    # Manage multiple AI agents in parallel
brew "gemini-cli"      # Google Gemini CLI
brew "sst/tap/opencode" # AI coding assistant TUI

# =============================================================================
# Fonts
# =============================================================================
cask "font-hack-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
